---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomAlt
source: html/ca69dffa-85af-307c-6dcc-f79a21edfb9a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomAlt Property

"Bottom (Alternating Bar)"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthBottomAlt { get; }
```